{"_id":{"$oid":"590790a93e86490d959ba53c"},"theme":"Technology","questionsArray":["What is your favorite piece of technology?","What do you prefer to do without technology?","What was your first computer?","What future technology are you the most excited about?"],"__v":0}
{"_id":{"$oid":"5907a3c53e86490d959ba541"},"theme":"Travel","questionsArray":["Q1","Q2","Q3","Q4","Q5"],"__v":0}
{"_id":{"$oid":"5908bcd3dacfd3041df7a630"},"theme":"Basic Interview Questions","questionsArray":["How would you describe yourself?","What specific goals have you established for your career?","What will it take to attain your goals, and what steps have you taken toward attaining them?","Please describe the ideal job for you.","How do you determine or evaluate success? Give me an example of one of your successful accomplishments.","Do you have the qualifications and personal characteristics necessary for success in your chosen career?","How would you describe yourself in terms of your ability to work as a member of a team?","What short-term goals and objectives have you established for yourself?","How would you evaluate your ability to deal with conflict?","Given the investment our company will make in hiring and training you, can you give us a reason to hire you?","Describe what you've accomplished toward reaching a recent goal for yourself.","Can you describe your long-range goals and objectives?","What major problem have you had to deal with recently? How did you handle it?","What plans do you have for continued study? An advanced degree?","Describe the characteristics of a successful manager.","Tell me what you know about our company.","Why do you think you might like to live in the community in which our company is located?","Would it be a problem for you to relocate?","To what extent would you be willing to travel for the job?"],"__v":0}
{"_id":{"$oid":"590a20d2c48bf4102cf890b8"},"theme":"Time","questionsArray":["How do you like to spend your leisure time?","Tell us about an experience when time seemed to stand still.","Tell us about an experience when time seemed to fly by.","What do you do to manage your own time?","Here is a fifth question"],"__v":0}
{"_id":{"$oid":"590b9fd53aa0252a0bb61595"},"theme":"Advanced Interview Quesitons","questionsArray":["Please give me a 60-second sales pitch about yourself.","Why do you want to work here?","Can you describe a frustrating workplace situation you faced and how you solved it?","Why are you leaving your current position?","What is your biggest weakness?","Talk about a time when you had to work closely with someone whose personality was very different from yours.","Give me an example of a time you faced a conflict while working on a team. How did you handle that?","Describe a time when you struggled to build a relationshiop with someone important. How did you eventually overcome that?","Tell me about a time you were able to successfully deal with another person even when that individual may not have personally liked you (or vice versa).","Tell me about a time when you delegated a project effectively. Give me an example of a time when you motivated others.","We all make mistakes we wish we could take back. Tell me about a time you wish you’d handled a situation differently with a colleague.","Tell me about a time you needed to get information from someone who wasn’t very responsive. What did you do?","Tell me about a time when you were forced to make an unpopular decision.","Tell me about a time you were under a lot of pressure. What was going on, and how did you get through it?","Give me an example of a time when you used your fact-finding skills to solve a problem.","Describe a time when your team or company was undergoing some change. How did that impact you, and how did you adapt?","Tell me about the first job you’ve ever had. What did you do to learn the ropes?","Give me an example of a time when you had to think on your feet in order to delicately extricate yourself from a difficult or awkward situation. Give me a specific example of a time when you used good judgment and logic in solving a problem.","Tell me about a time you failed. How did you deal with this situation?","Tell me about your proudest professional accomplishment.","Describe a time when you saw some problem and took the initiative to correct it rather than waiting for someone else to do it.","Tell me about a time when you worked under close supervision or extremely loose supervision. How did you handle that?","Tell me about a time when you had to go above and beyond the call of duty in order to get a job done.","Give me an example of a time you were able to be creative with your work. What was exciting or difficult about it?","Tell me about a time you were dissatisfied in your work. What could have been done to make it better?","Give me an example of a time when you were able to successfully persuade someone to see things your way at work.","Describe a time when you were the resident technical expert. What did you do to make sure everyone was able to understand you?","Tell me about a time when you had to rely on written communication to get your ideas across to your team.","Give me an example of a time when you had to explain something fairly complex to a frustrated client. How did you handle this delicate situation?","Tell me about a successful presentation you gave and why you think it was a hit.","Tell me about a time you had to be very strategic in order to meet all your top priorities.","Describe a long-term project that you managed. How did you keep everything moving along in a timely manner?","Sometimes it’s just not possible to get everything on your to-do list done. Tell me about a time your responsibilities got a little overwhelming. What did you do?","Tell me about a time you set a goal for yourself. How did you go about ensuring that you would meet your objective?","Give me an example of a time you managed numerous responsibilities. How did you handle that?"],"__v":0}
